[
  {
    "Id": "437845",
    "ThreadId": "211226",
    "Html": "<p>My site is almost up and running, but when i try to login or create a new user i get this error:</p>\r\n<p>Server Error in '/' Application.<br>--------------------------------------------------------------------------------<br><br>A network-related or instance-specific error occurred while establishing a connection to SQL Server. The server was not found or was not accessible. Verify that the instance name is correct and that SQL Server is configured to allow remote connections. (provider: SQL Network Interfaces, error: 26 - Error Locating Server/Instance Specified)&nbsp;<br>Description: An unhandled exception occurred during the execution of the current web request. Please review the stack trace for more information about the error and where it originated in the code.&nbsp;<br><br>SQLExpress database file auto-creation error:&nbsp;<br><br><br>The connection string specifies a local Sql Server Express instance using a database location within the applications App_Data directory. The provider attempted to automatically create the application services database because the provider determined that the database does not exist. The following configuration requirements are necessary to successfully check for existence of the application services database and automatically create the application services database:<br><br><br>If the applications App_Data directory does not already exist, the web server account must have read and write access to the applications directory. This is necessary because the web server account will automatically create the App_Data directory if it does not already exist.&nbsp;<br>If the applications App_Data directory already exists, the web server account only requires read and write access to the applications App_Data directory. This is necessary because the web server account will attempt to verify that the Sql Server Express database already exists within the applications App_Data directory. Revoking read access on the App_Data directory from the web server account will prevent the provider from correctly determining if the Sql Server Express database already exists. This will cause an error when the provider attempts to create a duplicate of an already existing database. Write access is required because the web server accounts credentials are used when creating the new database.&nbsp;<br>Sql Server Express must be installed on the machine.&nbsp;<br>The process identity for the web server account must have a local user profile. See the readme document for details on how to create a local user profile for both machine and domain accounts.&nbsp;<br><br><br>Source Error:&nbsp;<br><br>An unhandled exception was generated during the execution of the current web request. Information regarding the origin and location of the exception can be identified using the exception stack trace below. &nbsp;<br><br>Stack Trace:&nbsp;<br><br><br>[SqlException (0x80131904): A network-related or instance-specific error occurred while establishing a connection to SQL Server. The server was not found or was not accessible. Verify that the instance name is correct and that SQL Server is configured to allow remote connections. (provider: SQL Network Interfaces, error: 26 - Error Locating Server/Instance Specified)]<br>&nbsp;  System.Data.SqlClient.SqlInternalConnection.OnError(SqlException exception, Boolean breakConnection) +4846887<br>&nbsp;  System.Data.SqlClient.TdsParser.ThrowExceptionAndWarning(TdsParserStateObject stateObj) +194<br>&nbsp;  System.Data.SqlClient.TdsParser.Connect(ServerInfo serverInfo, SqlInternalConnectionTds connHandler, Boolean ignoreSniOpenTimeout, Int64 timerExpire, Boolean encrypt, Boolean trustServerCert, Boolean integratedSecurity, SqlConnection owningObject) +4860189<br>&nbsp;  System.Data.SqlClient.SqlInternalConnectionTds.AttemptOneLogin(ServerInfo serverInfo, String newPassword, Boolean ignoreSniOpenTimeout, Int64 timerExpire, SqlConnection owningObject) +90<br>&nbsp;  System.Data.SqlClient.SqlInternalConnectionTds.LoginNoFailover(String host, String newPassword, Boolean redirectedUserInstance, SqlConnection owningObject, SqlConnectionString connectionOptions, Int64 timerStart) +376<br>&nbsp;  System.Data.SqlClient.SqlInternalConnectionTds.OpenLoginEnlist(SqlConnection owningObject, SqlConnectionString connectionOptions, String newPassword, Boolean redirectedUserInstance) +221<br>&nbsp;  System.Data.SqlClient.SqlInternalConnectionTds..ctor(DbConnectionPoolIdentity identity, SqlConnectionString connectionOptions, Object providerInfo, String newPassword, SqlConnection owningObject, Boolean redirectedUserInstance) +189<br>&nbsp;  System.Data.SqlClient.SqlConnectionFactory.CreateConnection(DbConnectionOptions options, Object poolGroupProviderInfo, DbConnectionPool pool, DbConnection owningConnection) +4861315<br>&nbsp;  System.Data.ProviderBase.DbConnectionFactory.CreateNonPooledConnection(DbConnection owningConnection, DbConnectionPoolGroup poolGroup) +29<br>&nbsp;  System.Data.ProviderBase.DbConnectionFactory.GetConnection(DbConnection owningConnection) +4863644<br>&nbsp;  System.Data.ProviderBase.DbConnectionClosed.OpenConnection(DbConnection outerConnection, DbConnectionFactory connectionFactory) +117<br>&nbsp;  System.Data.SqlClient.SqlConnection.Open() +122<br>&nbsp;  System.Web.Management.SqlServices.GetSqlConnection(String server, String user, String password, Boolean trusted, String connectionString) +82<br><br>[HttpException (0x80004005): Unable to connect to SQL Server database.]<br>&nbsp;  System.Web.Management.SqlServices.GetSqlConnection(String server, String user, String password, Boolean trusted, String connectionString) +137<br>&nbsp;  System.Web.Management.SqlServices.SetupApplicationServices(String server, String user, String password, Boolean trusted, String connectionString, String database, String dbFileName, SqlFeatures features, Boolean install) +94<br>&nbsp;  System.Web.Management.SqlServices.Install(String database, String dbFileName, String connectionString) +25<br>&nbsp;  System.Web.DataAccess.SqlConnectionHelper.CreateMdfFile(String fullFileName, String dataDir, String connectionString) +395<br><br>&nbsp;<br>The App_Data folder is there, but the database is not placed there. The connectionstring is working fine with &nbsp;showing the news etc that is placed in the database, but for some reason not when i'm login or register new user.</p>\r\n<p>&nbsp;</p>\r\n<p>Any idea?</p>",
    "PostedDate": "2010-05-01T06:45:57.05-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]