[
  {
    "Id": "71882",
    "ThreadId": "21571",
    "Html": "\r\nThe MHRRC site, based on v3, b1, is in production after many questions on this forum. You can see it at <a href=\"http//www.mhrrc.org\" class=\"externalLink\">http//www.mhrrc.org<span class=\"externalLinkIcon\" style=\"font-family:Consolas, Courier New, Courier, Monospace;\"></span></a>.<br /><br />When you first look, some things of note that our users like:<br />1. Ad rotators for top banner pictures and side banners<br />2. Racing/Photo Albums: many photographers in our club and they post their pictures on some service like Shutterfly and Snapfish. We publish the links (this saves server space, we have hundreds of pictures, users can buy the images).<br />3. Racing/Kudos: MHRRC members can add running accomplishments in other races, always of interest to our members.<br />4. Marathon Project: separate area all done with FCKeditor (and fully qualified URLs for the pictures)<br />5. Racing/Results by race, by name, by division. Race results inserted into database with SQL manager<br />6. MHRRC Info/About the site: more about how the site was built (and credits to Codeplex project)<br /><br />The real usability of the site is when you login - everything there is updatable through a browser (except uploading race results). As webmaster, I was spending 5 - 10 hours per week on our old, static page site (developed with Expression Web). Now, we have different security roles and I can \"spread the wealth.\" Even if I update the site, it is much quicker to login and make changes than go the whole FTP route.<br /><br />Many thanks to everyone on this forum and to the Codeplex team for making this happen. I continue to learn (fly-out menus don't work on other browsers and I'm looking at control adopters). <br /><br />But, yes, Virginia, a novice can do this - but it takes a lot of time, learning, and persistence. I welcome your suggestions and comments.<br /><br />Deborah<br />",
    "PostedDate": "2008-02-05T11:43:36.42-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "75495",
    "ThreadId": "21571",
    "Html": "\r\nSite has been up for a month or so now. The browser compatibility issues continue to haunt me (most of our users access through IE, but 15-20% use Firefox or Safari).<br /><br />To solve the menu problem, look at <a href=\"http://www.codeplex.com/ClubStarterKit/Wiki/View.aspx?title=http%3a%2f%2fwww.asp.net%2fcssadapters%2fWhitePaper.aspx\">http://www.asp.net/cssadapters/WhitePaper.aspx</a> white paper. Basically, asp.net renders menu items as &lt;table&gt; tags, but these other browsers work better if they are &lt;ul&gt; and &lt;li&gt; tags with a high z-index to ensure the menu flyouts are on top of page elements. The white paper is good at describing this - but you also have to add some code to the web.config file (not explicitly stated in the white paper, but in the example) and add addtional code (not shown in the white paper)  into the app_browsers/cssfriendly adapters xml file for this to work properly. The white paper adapters code works well for IE6 but you need other stuff from <a href=\"http://www.codeplex.com/ClubStarterKit/Wiki/View.aspx?title=http%3a%2f%2fforums.asp.net%2fp%2f987503%2f1275579.aspx&amp;ANCHOR#1275579\">http://forums.asp.net/p/987503/1275579.aspx</a> for this to work for Firefox, Safari, Netscape.<br /><br />For the browser compatibility problem, in Firefox, download Firebug <a href=\"http://www.codeplex.com/ClubStarterKit/Wiki/View.aspx?title=www.getfirebug.com\">www.getfirebug.com</a>. This is a slick tool (watch the videos on CSS to learn it) that allows you to inspect elements on your page in the browser on the server and then change the CSS in Firebug to see what works. It helped me find the styles that were causing the problem in the \"cascade.\" You can change things on the fly (colors, sizes, etc.) and instantly see the impact on the page without having to change style sheet then view in browser then upload to server. Slick!<br />",
    "PostedDate": "2008-02-21T08:10:36.37-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]