[
  {
    "Id": "25467",
    "ThreadId": "7798",
    "Html": "\r\nIt was a lot of work getting it going - I trust a large part due to the fact that I'm a .net newbie - However - Many thanks for all of the efforts.  http://www.troop14scouts.org - and more<br />",
    "PostedDate": "2007-03-03T00:11:34.49-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "25481",
    "ThreadId": "7798",
    "Html": "\r\nNice site... Cub/Boy Scouts seems to be quite a popular implementation of the Club Starter Kit. I really like the use of the picture at the top... it gives it a nice feel. I think I'm going to put (on the wiki homepage) a \"Based on Club Starter Kit 2.0\" page for hosted sites to be put, are you interested?<br />",
    "PostedDate": "2007-03-03T09:29:53.433-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "25662",
    "ThreadId": "7798",
    "Html": "\r\nz2bass....Of course....I really appreciate the teams' efforts - and will continue adding content to the site.  The site has been reasonably stable for me now - and I dig the cms features.<br /><br />I'm going to speak with some of the area cub packs and offer the club website as a free service to our local cub packs.  I trust it's ok with you.  I'm even going to host it for them on my server for free.  --- I'm extending this to the local boy scout and cub scout packs in our area.  As I add them, I will add their url to the links page.  I trust this is cool with you.<br /><br />Take care.<br />",
    "PostedDate": "2007-03-05T15:15:52.533-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "25670",
    "ThreadId": "7798",
    "Html": "\r\nAwesome! Thanks for supporting CSK!<br />",
    "PostedDate": "2007-03-05T16:54:21.907-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "25807",
    "ThreadId": "7798",
    "Html": "\r\nAnd you already know that my cub scout pack site is running on club starter kit.  An older version of it (since I haven't had time to figure out why the Ajax stuff will not work on webhost4life).<br /><br />If you look at the site, it doesn't look like it is being used, but this is because we are waiting for the fall kickoff, and will only be telling the leaders about it until then.<br /><br />www.pack934.com<br />",
    "PostedDate": "2007-03-06T12:45:28.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "25849",
    "ThreadId": "7798",
    "Html": "\r\nOK, thats two... once I release B2 (tomorrow :) ) I will put those up.<br />",
    "PostedDate": "2007-03-06T17:23:47.02-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  }
]